Revit 2027 API
BuiltInFailures.ConnectorFailures.UnconnectedDevice Property
 Device has an unconnected [Type Name] connector (index = [Index Number]).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnconnectedDevice { get; }
Public Shared ReadOnly Property UnconnectedDevice As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnconnectedDevice {
	FailureDefinitionId^ get ();
}
static member UnconnectedDevice : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace